{
  "descriptions": {
    "abilities": {
      "shoot": "Shoot - the Shooter can fire two bullets per turn each deals <damage_> damage.\nRemaining bullets: <bullets_>.\n",
      "grenade": "Grenade - the Shooter can throw out a grenade that will deal <damage_> damage to the main target and half of that to targets around it.\nIt can be used only once per battle.",
      "blow_the_ax": "Blow The Ax - deals damage of: <damage> to single target.",
      "armor": "Armor - limits the maximum damage from a single attack that Destroyer can receive to: <max_damage>.",
      "arrow": "Arrow - the commander can shoot an arrow within range of <range> and deal damage of <damage>.\nIt also applied effect of viewfinder.\nThis effect allows commander to target these units regardless of the distance.\nViewfinder lasts for <viewfinder_duration> turns.",
      "aura_of_immunity": "Aura Of Immunity - giant offers a nearby allies aure\nwhich apply damage reduction of <damage_reduction_for_friends>.\nGiant also has constant damage reduction of <damage_reduction_for_owner>.",
      "counterattack": "Counterattack - native performs a counterattack if\nthe attacker is within his range.\nCounterattack deals <damage>. It works only once per turn.",
      "cure": "Cure - heals an ally by <healing_amount_per_turn> health and then the same amount every turn for <healing_duration> turns.\nMagic cost: <power_cost>.",
      "dodge": "Dodge - samurai avoids every third attack.\nReceived attacks from the last dodge: <counter>.",
      "drain": "Drain - deals damage of: <damage> and heals native by: <drain_amount> regardless of dealt damage.\nThis skill can heal over the base level of health.",
      "giant_blow": "Giant Blow - deals damage of <damage>.\nEvery third attack additionally causes that the enemy can attack\nonly the giant for one turn.\n",
      "giant_ram": "Giant Ram - the giant will accelerate and attack all units in his path.\nDamage: <damage>.\nThis ability can be used only once per battle.",
      "hypnosis": "Hypnosis - causes that the enemy unit will not be able to make a move\nin the next turn.\nIt can be used only once per battle.",
      "immortality": "Immortality - when the health of the warrior drops to zero\nthe warrior becomes immortal for one more turn.",
      "invisibility": "Invisibility - saberhand becomes invisible and can't receive any damage\nthrough <duration> turns.\nThis ability can be used only once per battle\n",
      "purification": "Purification - eliminates all removable negative effects from the unit.\nMagic cost: <power_cost>.",
      "dragon_skin": "Dragon Skin - reduce damage from magical attack by <magic_damage_reduction>.",
      "flame_burning": "Flame Burning - deals damage of: <damage>.\nIf enemy has magic power it also burn <burn_magic_power> of it\nand deal additional damage equal to this amount.",
      "moveable": "Move - standard way to move.\nRange: <range>.",
      "warrior_blow": "Warrior Blow - deals the more damage the less warrior has health.\nBase damage is <damage>.",
      "teleport": "Teleport - teleports the droid to a selected place on the map.\nIt can be used only once per battle.",
      "sword_blow": "Sword Blow - deals damage of: <damage> to all units around the samurai.\nIf the samurai hits minimum tree units he performs an additional blow.",
      "surroundings": "Surroundings - spider get <damage_reduction> damage reduction for each enemy\n in his neighborhood.Minimum damage is <min_damage>.",
      "stone_skin": "Stone Skin - with each received attack golem\nincrease his damage reduction by <reduction_increase_amount> points.\nCurrent damage reduction: <damage_reduction>.",
      "spider_web": "Spider Web - spider shoot his web within range of <range>.\nWeb deal <damage> damage, attracts the opponent and apply slow to him.",
      "jaw_spider": "Jaw Spider - deals <damage> damage.\nIf enemy is under Spider Web effect it deals <bonus_for_spider_web_effect> additional damage.",
      "lightning": "Lightning - mark enemy with lightning target.\nIn next turn lightning will hit enemy and deal <damage> damage.\nThis spell cost <power_cost> magic power.\nActual magic power: <power>.",
      "sabers": "Sabers - saberhand can acquire several neighboring targets\nand deal each of them damage of: <damage>.",
      "mortar_thrower": "Mortar Thrower - fires area missile with range <range> which deals <base_damage> of damage.\nIf Rocket Launcher was used earlier Mortar Thrower gain <rocket_change_bonus> additional damage.",
      "rocket_launcher": "Rocket Launcher - fires missile to range <range> which deals <base_damage> + <distance_bonus> damage\nfor each unit of range.\nIf Mortar Thrower was used earlier Rocket Launcher gain <rocket_change_bonus> additional damage.",
      "cleaver": "Cleaver - deals damage of <damage>.\nEach attack also charge spectre power for havoc.\nWhen power is fully charged cleaver can't be used.",
      "havoc": "Havoc - deals massive magic damage (<damage>) at a long distance. To use havoc spectre need to gather power which is charged by cleaver attack.\nTo use havoc <required_power> is required.",
      "immateriality": "Immateriality - Spectre ignore every first damage received in each turn.",
      "prison_connection": "Prison Connection - The Sorcerer throw a spell that deals <base_damage> of magic damage and apply prison connection effect. This effect last <duration> turns and causes to receive damage by every entity with it when sorcerer will use this skill next time. Additionally, for ech entity with a prison connection he gain <damage_per_entities_with_effect> to base damage.",
      "spear": "Spear - deals damage of <damage>.\nAdditionally for every received attack, guardian accumulates <additional_damage> damage which is consumed in the next attack.\nAccumulated damage: <accumulated_damage>.",
      "shield": "Shield - the Guardian receive only 50% percent from ranged damage.",
      "aura_of_destruction": "Aura Of Destruction - the Commander is protected by a magical aura with the strength equal his power points. If he will be attacked half of the damage received can be returned to his opponent in the form of a magical attack, consuming the aura power points."
    },
    "effects": {
      "viewfinder": "Viewfinder - the commander can use the arrow ability regardless of the distance from entity with applied effect.",
      "poisoning": "Poisoning - deals a slight damage with each turn.",
      "power_bullet_effect": "Power Bullet Effect - golem attacks to this entity will deal only 1/3 of his normal damage.",
      "spider_web_slow": "Spider Web Slow - entity is slow down to range of 1 for one turn.",
      "hypnotised": "Hypnotised - entity is hypnotised and can't do any move for one turn.",
      "prison_connection": "Prison Connection - this entity will also receive damage from Sorcerer if he attack any other entity."
    }
  }
}